energia/msp430-lg-core/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.cpu=Processor

##############################################################

MSP-EXP430F5529LP.vid.0=0x2341
MSP-EXP430F5529LP.pid.0=0x0c9f

MSP-EXP430F5529LP.name=MSP-EXP430F5529LP

MSP-EXP430F5529LP.build.mcu=msp430f5529
MSP-EXP430F5529LP.build.f_cpu=16000000L
MSP-EXP430F5529LP.build.core=msp430
MSP-EXP430F5529LP.build.variant=MSP-EXP430F5529LP
MSP-EXP430F5529LP.build.board=MSP_EXP430F5529LP

MSP-EXP430F5529LP.upload.tool=dslite
MSP-EXP430F5529LP.upload.protocol=dslite
MSP-EXP430F5529LP.upload.maximum_size=131072
MSP-EXP430F5529LP.upload.maximum_data_size=8192

#MSP-EXP430FR4133

MSP-EXP430FR4133LP.vid.0=0x2341
MSP-EXP430FR4133LP.pid.0=0x0c9f

MSP-EXP430FR4133LP.name=MSP-EXP430FR4133LP

MSP-EXP430FR4133LP.build.mcu=msp430fr4133
MSP-EXP430FR4133LP.build.f_cpu=8000000L
MSP-EXP430FR4133LP.build.core=msp430
MSP-EXP430FR4133LP.build.variant=MSP-EXP430FR4133LP
MSP-EXP430FR4133LP.build.board=MSP_EXP430FR4133LP

MSP-EXP430FR4133LP.upload.tool=dslite
MSP-EXP430FR4133LP.upload.protocol=dslite
MSP-EXP430FR4133LP.upload.maximum_size=15360
MSP-EXP430FR4133LP.upload.maximum_data_size=2048

#MSP-EXP430FR5969

MSP-EXP430FR5969LP.vid.0=0x2341
MSP-EXP430FR5969LP.pid.0=0x0c9f

MSP-EXP430FR5969LP.name=MSP-EXP430FR5969LP

MSP-EXP430FR5969LP.build.mcu=msp430fr5969
MSP-EXP430FR5969LP.build.f_cpu=8000000L
MSP-EXP430FR5969LP.build.core=msp430
MSP-EXP430FR5969LP.build.variant=MSP-EXP430FR5969LP
MSP-EXP430FR5969LP.build.board=MSP_EXP430FR5969LP

MSP-EXP430FR5969LP.upload.tool=dslite
MSP-EXP430FR5969LP.upload.protocol=dslite
MSP-EXP430FR5969LP.upload.maximum_size=65536
MSP-EXP430FR5969LP.upload.maximum_data_size=2048

#MSP-EXP430FR5969

MSP-EXP430FR6989LP.vid.0=0x2341
MSP-EXP430FR6989LP.pid.0=0x0c9f

MSP-EXP430FR6989LP.name=MSP-EXP430FR6989LP

MSP-EXP430FR6989LP.build.mcu=msp430fr6989
MSP-EXP430FR6989LP.build.f_cpu=8000000L
MSP-EXP430FR6989LP.build.core=msp430
MSP-EXP430FR6989LP.build.variant=MSP-EXP430FR6989LP
MSP-EXP430FR6989LP.build.board=MSP_EXP430FR6989LP

MSP-EXP430FR6989LP.upload.tool=dslite
MSP-EXP430FR6989LP.upload.protocol=dslite
MSP-EXP430FR6989LP.upload.maximum_size=130048
MSP-EXP430FR6989LP.upload.maximum_data_size=2048

#MSP-EXP430G2553

MSP-EXP430G2553LP.vid.0=0x2341
MSP-EXP430G2553LP.pid.0=0x0c9f

MSP-EXP430G2553LP.name=MSP-EXP430G2553LP

MSP-EXP430G2553LP.build.mcu=msp430g2553
MSP-EXP430G2553LP.build.f_cpu=16000000L
MSP-EXP430G2553LP.build.core=msp430
MSP-EXP430G2553LP.build.variant=MSP-EXP430G2553LP
MSP-EXP430G2553LP.build.board=MSP_EXP430G2553LP

MSP-EXP430G2553LP.upload.tool=mspdebug
MSP-EXP430G2553LP.upload.protocol=rf2500
MSP-EXP430G2553LP.upload.maximum_size=16384
MSP-EXP430G2553LP.upload.maximum_data_size=512

#MSP-EXP430FR5739

MSP-EXP430FR5739LP.vid.0=0x2341
MSP-EXP430FR5739LP.pid.0=0x0c9f

MSP-EXP430FR5739LP.name=MSP-EXP430FR5739LP

MSP-EXP430FR5739LP.build.mcu=msp430fr5739
MSP-EXP430FR5739LP.build.f_cpu=16000000L
MSP-EXP430FR5739LP.build.core=msp430
MSP-EXP430FR5739LP.build.variant=MSP-EXP430FR5739LP
MSP-EXP430FR5739LP.build.board=MSP_EXP430FR5739LP

MSP-EXP430FR5739LP.upload.tool=mspdebug
MSP-EXP430FR5739LP.upload.protocol=rf2500
MSP-EXP430FR5739LP.upload.maximum_size=16384
MSP-EXP430FR5739LP.upload.maximum_data_size=512

